Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.Unique Property
 Indicates whether the property value is copied when the object is copied.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Unique { get; set; }
Public Property Unique As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace